In [0]:
import pyspark.sql.functions as F

data = [
    (1, "Anderson", 10000),
    (2, "Kenedy", 20000),
    (3, "Billy", 23000),
    (4, "Andy", 23000),
    (5, "Mary", 24000),
    (6, "Eduardo", 19000),
    (7, "Mendes", 15000),
    (8, "Keyth", 18000),
    (9, "Truman", 21000),
]

schema = ["id", "name", "salary"]
df1 = spark.createDataFrame(data=data, schema=schema)
df1.printSchema()
df1.show(truncate=False)

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- salary: long (nullable = true)

+---+--------+------+
|id |name    |salary|
+---+--------+------+
|1  |Anderson|10000 |
|2  |Kenedy  |20000 |
|3  |Billy   |23000 |
|4  |Andy    |23000 |
|5  |Mary    |24000 |
|6  |Eduardo |19000 |
|7  |Mendes  |15000 |
|8  |Keyth   |18000 |
|9  |Truman  |21000 |
+---+--------+------+

In [0]:
import pyspark.sql.functions as F

data = [
    (1, "Delhi", "India"),
    (2, "Tamil nadu", "India"),
    (3, "London", "UK"),
    (4, "Sydney", "Australia"),
    (8, "New York", "USA"),
    (9, "California", "USA"),
    (10, "New Jersey", "USA"),
    (11, "Texas", "USA"),
    (12, "Chicago", "USA"),
]

schema = ["id", "place", "country"]
df2 = spark.createDataFrame(data=data, schema=schema)
df2.printSchema()
df2.show(truncate=False)

root
 |-- id: long (nullable = true)
 |-- place: string (nullable = true)
 |-- country: string (nullable = true)

+---+----------+---------+
|id |place     |country  |
+---+----------+---------+
|1  |Delhi     |India    |
|2  |Tamil nadu|India    |
|3  |London    |UK       |
|4  |Sydney    |Australia|
|8  |New York  |USA      |
|9  |California|USA      |
|10 |New Jersey|USA      |
|11 |Texas     |USA      |
|12 |Chicago   |USA      |
+---+----------+---------+

In [0]:
df_inner = df1.join(df2, on=['id'], how='inner')
df_inner.show(truncate=False)

+---+--------+------+----------+---------+
|id |name    |salary|place     |country  |
+---+--------+------+----------+---------+
|1  |Anderson|10000 |Delhi     |India    |
|2  |Kenedy  |20000 |Tamil nadu|India    |
|3  |Billy   |23000 |London    |UK       |
|4  |Andy    |23000 |Sydney    |Australia|
|8  |Keyth   |18000 |New York  |USA      |
|9  |Truman  |21000 |California|USA      |
+---+--------+------+----------+---------+

In [0]:
df_outer = df1.join(df2, on=['id'], how='outer')
df_outer.show(truncate=False)

+---+--------+------+----------+---------+
|id |name    |salary|place     |country  |
+---+--------+------+----------+---------+
|1  |Anderson|10000 |Delhi     |India    |
|2  |Kenedy  |20000 |Tamil nadu|India    |
|3  |Billy   |23000 |London    |UK       |
|4  |Andy    |23000 |Sydney    |Australia|
|5  |Mary    |24000 |null      |null     |
|6  |Eduardo |19000 |null      |null     |
|7  |Mendes  |15000 |null      |null     |
|8  |Keyth   |18000 |New York  |USA      |
|9  |Truman  |21000 |California|USA      |
|10 |null    |null  |New Jersey|USA      |
|11 |null    |null  |Texas     |USA      |
|12 |null    |null  |Chicago   |USA      |
+---+--------+------+----------+---------+

In [0]:
df_left = df1.join(df2, on=['id'], how='left')
df_left.show(truncate=False)

+---+--------+------+----------+---------+
|id |name    |salary|place     |country  |
+---+--------+------+----------+---------+
|1  |Anderson|10000 |Delhi     |India    |
|2  |Kenedy  |20000 |Tamil nadu|India    |
|3  |Billy   |23000 |London    |UK       |
|4  |Andy    |23000 |Sydney    |Australia|
|5  |Mary    |24000 |null      |null     |
|6  |Eduardo |19000 |null      |null     |
|7  |Mendes  |15000 |null      |null     |
|8  |Keyth   |18000 |New York  |USA      |
|9  |Truman  |21000 |California|USA      |
+---+--------+------+----------+---------+

In [0]:
df_right = df1.join(df2, on=['id'], how='right')
df_right.show(truncate=False)

+---+--------+------+----------+---------+
|id |name    |salary|place     |country  |
+---+--------+------+----------+---------+
|1  |Anderson|10000 |Delhi     |India    |
|2  |Kenedy  |20000 |Tamil nadu|India    |
|3  |Billy   |23000 |London    |UK       |
|4  |Andy    |23000 |Sydney    |Australia|
|8  |Keyth   |18000 |New York  |USA      |
|9  |Truman  |21000 |California|USA      |
|10 |null    |null  |New Jersey|USA      |
|11 |null    |null  |Texas     |USA      |
|12 |null    |null  |Chicago   |USA      |
+---+--------+------+----------+---------+

In [0]:
df_left_anti = df1.join(df2, on=['id'], how='left_anti')
df_left_anti.show(truncate=False)

+---+-------+------+
|id |name   |salary|
+---+-------+------+
|5  |Mary   |24000 |
|6  |Eduardo|19000 |
|7  |Mendes |15000 |
+---+-------+------+

In [0]:
df_left_semi = df1.join(df2, on=['id'], how='left_semi')
df_left_semi.show(truncate=False)

+---+--------+------+
|id |name    |salary|
+---+--------+------+
|1  |Anderson|10000 |
|2  |Kenedy  |20000 |
|3  |Billy   |23000 |
|4  |Andy    |23000 |
|8  |Keyth   |18000 |
|9  |Truman  |21000 |
+---+--------+------+

In [0]:
df_left_semi = df1.join(df2, on=['id'], how='full')
df_left_semi.show(truncate=False)

+---+--------+------+----------+---------+
|id |name    |salary|place     |country  |
+---+--------+------+----------+---------+
|1  |Anderson|10000 |Delhi     |India    |
|2  |Kenedy  |20000 |Tamil nadu|India    |
|3  |Billy   |23000 |London    |UK       |
|4  |Andy    |23000 |Sydney    |Australia|
|5  |Mary    |24000 |null      |null     |
|6  |Eduardo |19000 |null      |null     |
|7  |Mendes  |15000 |null      |null     |
|8  |Keyth   |18000 |New York  |USA      |
|9  |Truman  |21000 |California|USA      |
|10 |null    |null  |New Jersey|USA      |
|11 |null    |null  |Texas     |USA      |
|12 |null    |null  |Chicago   |USA      |
+---+--------+------+----------+---------+

In [0]:
df_anti = df1.join(df2, on=['id'], how='anti')
df_anti.show(truncate=False)

+---+-------+------+
|id |name   |salary|
+---+-------+------+
|5  |Mary   |24000 |
|6  |Eduardo|19000 |
|7  |Mendes |15000 |
+---+-------+------+